# Copyright 2025 OpenHW Group
#
# Licensed under the Solderpad Hardware Licence, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     https://solderpad.org/licenses/
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

[gold]
plugin -i slang
read_slang --ignore-assertions -DGOLD --top cve2_top -f ./golden.src

[gate]
plugin -i slang
read_slang --ignore-assertions -DGATE --top cve2_top -G Xinterface=0 -f ./revised.src
delete cve2_top/x_*

[script]
prep -top cve2_top
memory_map

[strategy sat]
use sat
depth 5

