# Copyright 2025 OpenHW Foundation
#
# Licensed under the Solderpad Hardware Licence, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     https://solderpad.org/licenses/
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

# To be ran as part of `./sec.sh -t yosys` from `scripts/sec`

[gold]
plugin -i slang
read_slang --ignore-assertions -DGOLD --top cve2_top -f ./golden.src

# Save the list of IO signals, in case the new revised version is different
select -write yosys/golden_io.txt  o:* i:* 

[gate]
plugin -i slang
read_slang --ignore-assertions -DGATE --top cve2_top -f ./revised.src


# Delete eventual new IO signals from the revised design from analysis
select -set golden_io -read yosys/golden_io.txt
select -set revised_io o:* i:*
select -set excl_sigs @revised_io @golden_io %d
delete @excl_sigs

[script]
prep -top cve2_top
memory_map

[strategy sat]
use sat
depth 5

